tutorials/catalyticWallsReactingFoam/annulus/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices        
(
	( 0.0 -0.1	2.35)        //0
  	(10.0 -0.1	2.35)        //1
	(10.0  0.1	2.35)        //2
	( 0.0  0.1	2.35)        //3
	( 0.0 -0.1	4.50)        //4
  	(10.0 -0.1	4.50)        //5
	(10.0  0.1	4.50)        //6
	( 0.0  0.1	4.50)        //7
  	(25.0 -0.1	2.35)        //8
	(25.0  0.1	2.35)        //9
	(25.0  0.1	4.50)        //10
  	(25.0 -0.1	4.50)        //11
);

edges
(
);

blocks
(
	// Central
	hex (0 1 2 3 4 5 6 7)       (170 1 30) simpleGrading (1  1  3)
	hex (1 8 9 2 5 11 10 6)     (255 1 30) simpleGrading (1  1  3)

);

patches
(
    wall reactingWall
    (
        (1 2 9 8)
    )

    wall inertWall
    (
        (4 5 6 7)
        (0 3 2 1)
        (5 11 10 6)
    )

    patch inlet
    (
        (0 4 7 3)
    )

    patch outlet
    (
        (8 9 10 11)
    )
);

mergePatchPairs 
(
);

// ************************************************************************* //
