tutorials/catalyticWallsReactingFoam/annulus/system/sampleWall
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes graph data for specified fields along a line, specified by start
    and end points.
\*---------------------------------------------------------------------------*/

type            sets;
libs            ("libsampling.so");

writeControl    writeTime;

interpolationScheme cellPointFace;

setFormat   csv;

sets
(
    lineW
    {
        type        boundaryPoints;  
        points
        (
            (0.0105 0 0.00235)
            (0.011 0 0.00235)
            (0.0115 0 0.00235)
            (0.012 0 0.00235)
            (0.0125 0 0.00235)
            (0.013 0 0.00235)
            (0.0135 0 0.00235)
            (0.014 0 0.00235)
            (0.0145 0 0.00235)
            (0.015 0 0.00235)
            (0.0155 0 0.00235)
            (0.016 0 0.00235)
            (0.0165 0 0.00235)
            (0.017 0 0.00235)
            (0.0175 0 0.00235)
            (0.018 0 0.00235)
            (0.0185 0 0.00235)
            (0.019 0 0.00235)
            (0.0195 0 0.00235)
            (0.020 0 0.00235)
            (0.0205 0 0.00235)
            (0.021 0 0.00235)
            (0.0215 0 0.00235)
            (0.022 0 0.00235)
            (0.0225 0 0.00235)
            (0.023 0 0.00235)
            (0.0235 0 0.00235)
            (0.024 0 0.00235)
            (0.0245 0 0.00235)
            (0.025 0 0.00235)
        );
        patches     (reactingWall);
        axis        x;
        maxDistance 0.001;
    }
);

fields  
(
    Rh(s).catalyst
    O(s).catalyst
    OH(s).catalyst
    H(s).catalyst
    H2O(s).catalyst
);

// ************************************************************************* //
